In [5]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass
password = getpass.getpass()

bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [13]:
from sqlalchemy import text

def rentals_month(engine, month, year):
    query = text('''
        SELECT * 
        FROM sakila.rental 
        WHERE MONTH(rental_date) = :month AND YEAR(rental_date) = :year
    ''')

    with engine.connect() as connection:
        result = connection.execute(query, {"month": month, "year": year})
        df = pd.DataFrame(result.fetchall(), columns=result.keys())
        
    return df

In [14]:
df1 = rentals_month(engine,5,2005)
df1.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [ ]:
def rental_count_month(df, month, year):
    # Formateamos el nombre de columna como "rentals_05_2005"
    column_name = f"rentals_{int(month):02d}_{year}"
    
    # Agrupamos por customer_id y contamos el número de préstamos (rental)
    rental_counts = df.groupby('customer_id').size().reset_index(name=column_name)
    
    return rental_counts

In [16]:
df2 = rental_count_month(df1,5,2005)
df2.head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [ ]:
def compare_rentals(df1, df2):
    # Mergeamos los dos DataFrames según 'customer_id'
    df_combined = pd.merge(df1, df2, on='customer_id', how='outer').fillna(0)
    
    # Identificamos los nombres de las columnas de préstamo (excluyendo 'customer_id')
    col_names = [col for col in df_combined.columns if col != 'customer_id']
    
    if len(col_names) != 2:
        raise ValueError("Cada DataFrame debería contener un única columna de conteo de préstamo bajo 'customer_id'.")

    # Calculamos la diferencia
    df_combined['difference'] = df_combined[col_names[0]] - df_combined[col_names[1]]
    
    return df_combined

In [18]:
df_may = rental_count_month(rentals_month(engine, 5, 2005), 5, 2005)
df_june = rental_count_month(rentals_month(engine, 6, 2005), 6, 2005)

df_comparison = compare_rentals(df_may, df_june)

df_comparison

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1              2.0              7.0        -5.0
1              2              1.0              1.0         0.0
2              3              2.0              4.0        -2.0
3              4              0.0              6.0        -6.0
4              5              3.0              5.0        -2.0
..           ...              ...              ...         ...
593          595              1.0              2.0        -1.0
594          596              6.0              2.0         4.0
595          597              2.0              3.0        -1.0
596          598              0.0              1.0        -1.0
597          599              1.0              4.0        -3.0

[598 rows x 4 columns]